#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьСтатьиПоУмолчанию(Команда)
	ЗаполнитьСтатьиПоУмолчаниюНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСтатьиПоУмолчаниюНаСервере()
	
	СоздатьСтатьюПродажи();
	СоздатьСтатьюВыручка();
	СоздатьСтатьюНДС();
	СоздатьСтатьюЧистаяВыручка();
	СоздатьСтатьюСредняяЦенаПродаж();
	СоздатьСтатьюСебестоимость();
	СоздатьСтатьюОплатаТруда();
	СоздатьСтатьюВаловаяПрибыль();
	СоздатьСтатьюВаловаяПрибыльПроцент();
	СоздатьСтатьюУправленческиеРасходы();
	СоздатьСтатьюАмортизация();
	СоздатьСтатьюКоммерческиеРасходы();
	СоздатьСтатьюEbitda();
	СоздатьСтатьюПрочиеДоходы();
	СоздатьСтатьюПрочиеРасходы();
	СоздатьСтатьюПрибыльДоНалогооблажения();
	
	Элементы.Список.Обновить();

КонецПроцедуры

&НаСервере
Процедура СоздатьСтатьюПродажи()
	
	Идентификатор = "ПродажиКоличество";
	Статья = Справочники.бджСтатьиБюджетаДоходовИРасходов.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если Не ЗначениеЗаполнено(Статья) Тогда
		СтатьяОбъект = Справочники.бджСтатьиБюджетаДоходовИРасходов.СоздатьЭлемент();
		СтатьяОбъект.Идентификатор 	= Идентификатор;	
		СтатьяОбъект.Использовать 	= Истина;		
	Иначе
		СтатьяОбъект = Статья.ПолучитьОбъект();
	КонецЕсли;	
	СтатьяОбъект.Порядок 	  	= 10;
	СтатьяОбъект.Наименование 	= НСтр("ru = 'Продажи, шт.'");		
	СтатьяОбъект.ТипАналитики 	= Перечисления.бджТипыАналитикиСтатейБюджетаДоходовИРасходов.НоменклатурнаяГруппа;
	СтатьяОбъект.Описание 		= НСтр("ru = 'Количество оборот по Кт счета 90.01.1.'");
	СтатьяОбъект.ТекстЗапросаПолученияФакта =
	"ВЫБРАТЬ
	|	Обороты.Организация КАК Организация,
	|	НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ) КАК Месяц,
	|	Обороты.Субконто1 КАК Аналитика,
	|	Обороты.КоличествоОборотКт КАК ЗначениеФакт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц,
	|		Счет.КодБыстрогоВыбора = ""90011"",,,,) КАК Обороты";
	СтатьяОбъект.Записать();

КонецПроцедуры

&НаСервере
Процедура СоздатьСтатьюВыручка()
	
	Идентификатор = "Выручка";
	Статья = Справочники.бджСтатьиБюджетаДоходовИРасходов.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если Не ЗначениеЗаполнено(Статья) Тогда
		СтатьяОбъект = Справочники.бджСтатьиБюджетаДоходовИРасходов.СоздатьЭлемент();
		СтатьяОбъект.Идентификатор 	= Идентификатор;	
		СтатьяОбъект.Использовать 	= Истина;
	Иначе
		СтатьяОбъект = Статья.ПолучитьОбъект();
	КонецЕсли;	
	СтатьяОбъект.Порядок 		= 30;
	СтатьяОбъект.Наименование 	= НСтр("ru = 'Выручка'");		
	СтатьяОбъект.ТипАналитики 	= Перечисления.бджТипыАналитикиСтатейБюджетаДоходовИРасходов.НоменклатурнаяГруппа;
	СтатьяОбъект.Описание 		= НСтр("ru = 'Сумма оборота по счету 90.01.1.'");
	СтатьяОбъект.ТекстЗапросаПолученияФакта =
	"ВЫБРАТЬ
	|	Обороты.Организация КАК Организация,
	|	НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ) КАК Месяц,
	|	Обороты.Субконто1 КАК Аналитика,
	|	Обороты.СуммаОборотКт КАК ЗначениеФакт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц,
	|		Счет.КодБыстрогоВыбора = ""90011"",,,,) КАК Обороты";
	СтатьяОбъект.Записать();

КонецПроцедуры

&НаСервере
Процедура СоздатьСтатьюНДС()
	
	Идентификатор = "НДС";
	Статья = Справочники.бджСтатьиБюджетаДоходовИРасходов.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если Не ЗначениеЗаполнено(Статья) Тогда
		СтатьяОбъект = Справочники.бджСтатьиБюджетаДоходовИРасходов.СоздатьЭлемент();
		СтатьяОбъект.Идентификатор 	= Идентификатор;	
		СтатьяОбъект.Использовать 	= Истина;
	Иначе
		СтатьяОбъект = Статья.ПолучитьОбъект();
	КонецЕсли;	
	СтатьяОбъект.Порядок 		= 50;
	СтатьяОбъект.Наименование 	= НСтр("ru = 'НДС'");		
	СтатьяОбъект.ТипАналитики 	= Перечисления.бджТипыАналитикиСтатейБюджетаДоходовИРасходов.НоменклатурнаяГруппа;
	СтатьяОбъект.Описание 		= НСтр("ru = 'Сумма оборота по Дт счету 90.03.'");
	СтатьяОбъект.ТекстЗапросаПолученияФакта =
	"ВЫБРАТЬ
	|	Обороты.Организация КАК Организация,
	|	НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ) КАК Месяц,
	|	Обороты.Субконто1 КАК Аналитика,
	|	Обороты.СуммаОборотДт КАК ЗначениеФакт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц,
	|		Счет.КодБыстрогоВыбора = ""9003"",,,,) КАК Обороты";
	СтатьяОбъект.Записать();

КонецПроцедуры

&НаСервере
Процедура СоздатьСтатьюЧистаяВыручка()
	
	Идентификатор = "ЧистаяВыручка";
	Статья = Справочники.бджСтатьиБюджетаДоходовИРасходов.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если Не ЗначениеЗаполнено(Статья) Тогда
		СтатьяОбъект = Справочники.бджСтатьиБюджетаДоходовИРасходов.СоздатьЭлемент();
		СтатьяОбъект.Идентификатор 	= Идентификатор;	
		СтатьяОбъект.Использовать 	= Истина;
	Иначе
		СтатьяОбъект = Статья.ПолучитьОбъект();
	КонецЕсли;	
	СтатьяОбъект.Порядок 		= 20;
	СтатьяОбъект.Наименование 	= НСтр("ru = 'Чистая выручка'");		
	СтатьяОбъект.ТипАналитики 	= Перечисления.бджТипыАналитикиСтатейБюджетаДоходовИРасходов.НоменклатурнаяГруппа;
	СтатьяОбъект.Описание 		= НСтр("ru = 'Выручка минус НДС (Разница между оборотами по счету 90.01.1 и 90.03.'");
	СтатьяОбъект.ТекстЗапросаПолученияФакта =
	"Выбрать
	|	РезультатНеСвернутый.Организация,
	|	РезультатНеСвернутый.Месяц,
	|	РезультатНеСвернутый.Аналитика,
	|	СУММА(РезультатНеСвернутый.ЗначениеФакт) КАК ЗначениеФакт
	|Из
	|	(ВЫБРАТЬ
	|		Обороты.Организация КАК Организация,
	|		НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ) КАК Месяц,
	|		Обороты.Субконто1 КАК Аналитика,
	|		Обороты.СуммаОборотКт КАК ЗначениеФакт // Выручка
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц,
	|			Счет.КодБыстрогоВыбора = ""90011"",,,,) КАК Обороты
	|
	|	Объединить Все
	|
	|	ВЫБРАТЬ
	|		Обороты.Организация,
	|		НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ),
	|		Обороты.Субконто1,
	|		-Обороты.СуммаОборотДт // НДС
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц,
	|			Счет.КодБыстрогоВыбора = ""9003"",,,,) КАК Обороты) Как РезультатНеСвернутый
	|СГРУППИРОВАТЬ ПО
	|	РезультатНеСвернутый.Организация,
	|	РезультатНеСвернутый.Месяц,
	|	РезультатНеСвернутый.Аналитика";
	СтатьяОбъект.Записать();

КонецПроцедуры

&НаСервере
Процедура СоздатьСтатьюСредняяЦенаПродаж()
	
	Идентификатор = "СредняяЦенаПродаж";
	Статья = Справочники.бджСтатьиБюджетаДоходовИРасходов.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если Не ЗначениеЗаполнено(Статья) Тогда
		СтатьяОбъект = Справочники.бджСтатьиБюджетаДоходовИРасходов.СоздатьЭлемент();
		СтатьяОбъект.Идентификатор 	= Идентификатор;	
		СтатьяОбъект.Использовать 	= Истина;
	Иначе
		СтатьяОбъект = Статья.ПолучитьОбъект();
	КонецЕсли;	
	СтатьяОбъект.Порядок 				= 40;
	СтатьяОбъект.Наименование 			= НСтр("ru = 'Средняя цена продаж'");		
	СтатьяОбъект.ТипАналитики 			= Перечисления.бджТипыАналитикиСтатейБюджетаДоходовИРасходов.НоменклатурнаяГруппа;
	СтатьяОбъект.Описание 				= НСтр("ru = 'Выручка / Продажи, шт. (сумма оборот по счету 90.01.1 деленная на Количество оборот по Кт того же счета)'");
	СтатьяОбъект.НеРассчитыватьИтоги 	= Истина;
	СтатьяОбъект.ТекстЗапросаПолученияФакта =
	"ВЫБРАТЬ
	|	Обороты.Организация КАК Организация,
	|	НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ) КАК Месяц,
	|	Обороты.Субконто1 КАК Аналитика,
	|	Выбор
	|		Когда Обороты.КоличествоОборотКт = 0
	|			Тогда 0
	|		Иначе Обороты.СуммаОборотКт / Обороты.КоличествоОборотКт
	|	Конец КАК ЗначениеФакт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц,
	|		Счет.КодБыстрогоВыбора = ""90011"",,,,) КАК Обороты";;
	СтатьяОбъект.Записать();

КонецПроцедуры

&НаСервере
Процедура СоздатьСтатьюСебестоимость()
	
	Идентификатор = "Себестоимость";
	Статья = Справочники.бджСтатьиБюджетаДоходовИРасходов.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если Не ЗначениеЗаполнено(Статья) Тогда
		СтатьяОбъект = Справочники.бджСтатьиБюджетаДоходовИРасходов.СоздатьЭлемент();
		СтатьяОбъект.Идентификатор 	= Идентификатор;	
		СтатьяОбъект.Использовать 	= Истина;
	Иначе
		СтатьяОбъект = Статья.ПолучитьОбъект();
	КонецЕсли;	
	СтатьяОбъект.Порядок 		= 60;
	СтатьяОбъект.Наименование 	= НСтр("ru = 'Себестоимость'");		
	СтатьяОбъект.ТипАналитики 	= Перечисления.бджТипыАналитикиСтатейБюджетаДоходовИРасходов.НоменклатурнаяГруппа;
	СтатьяОбъект.Описание 		= НСтр("ru = 'Сумма оборот Дт счета 20.01 по номенклатурным группам.'");
	СтатьяОбъект.ТекстЗапросаПолученияФакта =
	"ВЫБРАТЬ
	|	Обороты.Организация КАК Организация,
	|	НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ) КАК Месяц,
	|	Обороты.Субконто1 КАК Аналитика,
	|	Обороты.СуммаОборотДт КАК ЗначениеФакт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц,
	|		Счет.КодБыстрогоВыбора = ""2001"",,,,) КАК Обороты";
	СтатьяОбъект.Записать();

КонецПроцедуры

&НаСервере
Процедура СоздатьСтатьюОплатаТруда()
	
	Идентификатор = "ОплатаТруда";
	Статья = Справочники.бджСтатьиБюджетаДоходовИРасходов.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если Не ЗначениеЗаполнено(Статья) Тогда
		СтатьяОбъект = Справочники.бджСтатьиБюджетаДоходовИРасходов.СоздатьЭлемент();
		СтатьяОбъект.Идентификатор 	= Идентификатор;	
		СтатьяОбъект.Использовать 	= Истина;
	Иначе
		СтатьяОбъект = Статья.ПолучитьОбъект();
	КонецЕсли;	
	СтатьяОбъект.Порядок 		= 70;
	СтатьяОбъект.Наименование 	= НСтр("ru = 'В том числе оплата труда'");		
	СтатьяОбъект.ТипАналитики 	= Перечисления.бджТипыАналитикиСтатейБюджетаДоходовИРасходов.СтатьяЗатрат;
	СтатьяОбъект.Описание 		= НСтр("ru = 'Сумма оборот Дт счета 20.01 по статьям затрат.'");
	СтатьяОбъект.ТекстЗапросаПолученияФакта =
	"ВЫБРАТЬ
	|	Обороты.Организация КАК Организация,
	|	НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ) КАК Месяц,
	|	Обороты.Субконто2 КАК Аналитика,
	|	Обороты.СуммаОборотДт КАК ЗначениеФакт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц, Счет.КодБыстрогоВыбора = ""2001"",,
	|		ВЫРАЗИТЬ(Субконто2 КАК Справочник.СтатьиЗатрат).Наименование = ""Оплата труда""
	|	ИЛИ ВЫРАЗИТЬ(Субконто2 КАК Справочник.СтатьиЗатрат).Наименование = ""Страховые взносы"",,) КАК Обороты";
	СтатьяОбъект.Записать();

КонецПроцедуры

&НаСервере
Процедура СоздатьСтатьюВаловаяПрибыль()
	
	Идентификатор = "ВаловаяПрибыль";
	Статья = Справочники.бджСтатьиБюджетаДоходовИРасходов.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если Не ЗначениеЗаполнено(Статья) Тогда
		СтатьяОбъект = Справочники.бджСтатьиБюджетаДоходовИРасходов.СоздатьЭлемент();
		СтатьяОбъект.Идентификатор 	= Идентификатор;	
		СтатьяОбъект.Использовать 	= Истина;
	Иначе
		СтатьяОбъект = Статья.ПолучитьОбъект();
	КонецЕсли;	
	СтатьяОбъект.Порядок 		= 80;
	СтатьяОбъект.Наименование 	= НСтр("ru = 'Валовая прибыль'");		
	СтатьяОбъект.ТипАналитики 	= Перечисления.бджТипыАналитикиСтатейБюджетаДоходовИРасходов.НоменклатурнаяГруппа;
	СтатьяОбъект.Описание 		= НСтр("ru = 'Выручка - НДС - Себестоимость'");
	СтатьяОбъект.ТекстЗапросаПолученияФакта =
	"ВЫБРАТЬ
	|	РезультатНеСгруппированный.Организация КАК Организация,
	|	РезультатНеСгруппированный.Месяц КАК Месяц,
	|	РезультатНеСгруппированный.Аналитика КАК Аналитика,
	|	СУММА(РезультатНеСгруппированный.ЗначениеФакт) КАК ЗначениеФакт
	|ИЗ
	|	(ВЫБРАТЬ
	|		Обороты.Организация КАК Организация,
	|		НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ) КАК Месяц,
	|		Обороты.Субконто1 КАК Аналитика,
	|		Обороты.СуммаОборотКт КАК ЗначениеФакт // Выручка
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц,
	|			Счет.КодБыстрогоВыбора = ""90011"",,,,) КАК Обороты
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Обороты.Организация,
	|		НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ),
	|		Обороты.Субконто1,
	|		-Обороты.СуммаОборотДт // НДС
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц,
	|			Счет.КодБыстрогоВыбора = ""9003"",,,,) КАК Обороты
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Обороты.Организация,
	|		НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ),
	|		Обороты.Субконто1,
	|		-Обороты.СуммаОборотДт // Себестоимость
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц,
	|			Счет.КодБыстрогоВыбора = ""2001"",,,,) КАК Обороты) КАК РезультатНеСгруппированный
	|СГРУППИРОВАТЬ ПО
	|	РезультатНеСгруппированный.Организация,
	|	РезультатНеСгруппированный.Месяц,
	|	РезультатНеСгруппированный.Аналитика";
	СтатьяОбъект.Записать();

КонецПроцедуры

&НаСервере
Процедура СоздатьСтатьюВаловаяПрибыльПроцент()
	
	Идентификатор = "ВаловаяПрибыльПроцент";
	Статья = Справочники.бджСтатьиБюджетаДоходовИРасходов.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если Не ЗначениеЗаполнено(Статья) Тогда
		СтатьяОбъект = Справочники.бджСтатьиБюджетаДоходовИРасходов.СоздатьЭлемент();
		СтатьяОбъект.Идентификатор 	= Идентификатор;	
		СтатьяОбъект.Использовать 	= Истина;
	Иначе
		СтатьяОбъект = Статья.ПолучитьОбъект();
	КонецЕсли;	
	СтатьяОбъект.Порядок 				= 90;
	СтатьяОбъект.Наименование 			= НСтр("ru = 'Валовая прибыль %'");		
	СтатьяОбъект.ТипАналитики 			= Перечисления.бджТипыАналитикиСтатейБюджетаДоходовИРасходов.НоменклатурнаяГруппа;
	СтатьяОбъект.Описание 				= НСтр("ru = '(Выручка - НДС - Себестоимость) / (Выручка - НДС)'");
	СтатьяОбъект.НеРассчитыватьИтоги 	= Истина;
	СтатьяОбъект.ТекстЗапросаПолученияФакта =
	"ВЫБРАТЬ
	|	РезультатНеСгруппированный.Организация КАК Организация,
	|	РезультатНеСгруппированный.Месяц КАК Месяц,
	|	РезультатНеСгруппированный.Аналитика КАК Аналитика,
	|	Выбор
	|		Когда Сумма(РезультатНеСгруппированный.ЧистаяВыручка) = 0
	|			Тогда 0
	|		Иначе СУММА(РезультатНеСгруппированный.ВаловаяПрибыль) / Сумма(РезультатНеСгруппированный.ЧистаяВыручка) * 100
	|	Конец КАК ЗначениеФакт
	|ИЗ
	|	(ВЫБРАТЬ
	|		Обороты.Организация КАК Организация,
	|		НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ) КАК Месяц,
	|		Обороты.Субконто1 КАК Аналитика,
	|		Обороты.СуммаОборотКт КАК ВаловаяПрибыль,
	|		Обороты.СуммаОборотКт КАК ЧистаяВыручка
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц,
	|			Счет.КодБыстрогоВыбора = ""90011"",,,,) КАК Обороты
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Обороты.Организация,
	|		НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ),
	|		Обороты.Субконто1,
	|		-Обороты.СуммаОборотДт, // НДС
	|		-Обороты.СуммаОборотДт
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц,
	|			Счет.КодБыстрогоВыбора = ""9003"",,,,) КАК Обороты
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Обороты.Организация,
	|		НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ),
	|		Обороты.Субконто1,
	|		-Обороты.СуммаОборотДт, // Себестоимость
	|		0
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц,
	|			Счет.КодБыстрогоВыбора = ""2001"",,,,) КАК Обороты) КАК РезультатНеСгруппированный
	|СГРУППИРОВАТЬ ПО
	|	РезультатНеСгруппированный.Организация,
	|	РезультатНеСгруппированный.Месяц,
	|	РезультатНеСгруппированный.Аналитика";
	СтатьяОбъект.Записать();

КонецПроцедуры

&НаСервере
Процедура СоздатьСтатьюУправленческиеРасходы()
	
	Идентификатор = "УправленческиеРасходы";
	Статья = Справочники.бджСтатьиБюджетаДоходовИРасходов.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если Не ЗначениеЗаполнено(Статья) Тогда
		СтатьяОбъект = Справочники.бджСтатьиБюджетаДоходовИРасходов.СоздатьЭлемент();
		СтатьяОбъект.Идентификатор 	= Идентификатор;	
		СтатьяОбъект.Использовать 	= Истина;
	Иначе
		СтатьяОбъект = Статья.ПолучитьОбъект();
	КонецЕсли;	
	СтатьяОбъект.Порядок 		= 90;
	СтатьяОбъект.Наименование 	= НСтр("ru = 'Управленческие расходы'");		
	СтатьяОбъект.ТипАналитики 	= Перечисления.бджТипыАналитикиСтатейБюджетаДоходовИРасходов.БезАналитики;
	СтатьяОбъект.Описание 		= НСтр("ru = 'Обороты Дт счета 26 (кроме амортизации)'");
	СтатьяОбъект.ТекстЗапросаПолученияФакта =
	"ВЫБРАТЬ
	|	Обороты.Организация КАК Организация,
	|	НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ) КАК Месяц,
	|	Обороты.Субконто1 КАК Аналитика,
	|	Обороты.СуммаОборотДт КАК ЗначениеФакт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц, Счет.КодБыстрогоВыбора = ""26"",,
	|		ВЫРАЗИТЬ(Субконто1 КАК Справочник.СтатьиЗатрат).Наименование <> ""Амортизация"",,) КАК Обороты";
	СтатьяОбъект.Записать();

КонецПроцедуры

&НаСервере
Процедура СоздатьСтатьюАмортизация()
	
	Идентификатор = "Амортизация";
	Статья = Справочники.бджСтатьиБюджетаДоходовИРасходов.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если Не ЗначениеЗаполнено(Статья) Тогда
		СтатьяОбъект = Справочники.бджСтатьиБюджетаДоходовИРасходов.СоздатьЭлемент();
		СтатьяОбъект.Идентификатор 	= Идентификатор;	
		СтатьяОбъект.Использовать 	= Истина;
	Иначе
		СтатьяОбъект = Статья.ПолучитьОбъект();
	КонецЕсли;	
	СтатьяОбъект.Порядок 		= 120;
	СтатьяОбъект.Наименование 	= НСтр("ru = 'Амортизация'");		
	СтатьяОбъект.ТипАналитики 	= Перечисления.бджТипыАналитикиСтатейБюджетаДоходовИРасходов.БезАналитики;
	СтатьяОбъект.Описание 		= НСтр("ru = 'Обороты Дт счета 26 (по статье затрат амортизация)'");
	СтатьяОбъект.ТекстЗапросаПолученияФакта =
	"ВЫБРАТЬ
	|	Обороты.Организация КАК Организация,
	|	НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ) КАК Месяц,
	|	Обороты.Субконто1 КАК Аналитика,
	|	Обороты.СуммаОборотДт КАК ЗначениеФакт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц, Счет.КодБыстрогоВыбора = ""26"",,
	|		ВЫРАЗИТЬ(Субконто1 КАК Справочник.СтатьиЗатрат).Наименование = ""Амортизация"",,) КАК Обороты";
	СтатьяОбъект.Записать();

КонецПроцедуры

&НаСервере
Процедура СоздатьСтатьюКоммерческиеРасходы()
	
	Идентификатор = "КоммерческиеРасходы";
	Статья = Справочники.бджСтатьиБюджетаДоходовИРасходов.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если Не ЗначениеЗаполнено(Статья) Тогда
		СтатьяОбъект = Справочники.бджСтатьиБюджетаДоходовИРасходов.СоздатьЭлемент();
		СтатьяОбъект.Идентификатор 	= Идентификатор;	
		СтатьяОбъект.Использовать 	= Истина;
	Иначе
		СтатьяОбъект = Статья.ПолучитьОбъект();
	КонецЕсли;	
	СтатьяОбъект.Порядок 		= 100;
	СтатьяОбъект.Наименование 	= НСтр("ru = 'Коммерческие расходы'");		
	СтатьяОбъект.ТипАналитики 	= Перечисления.бджТипыАналитикиСтатейБюджетаДоходовИРасходов.БезАналитики;
	СтатьяОбъект.Описание 		= НСтр("ru = 'Обороты Дт счета 44'");
	СтатьяОбъект.ТекстЗапросаПолученияФакта =
	"ВЫБРАТЬ
	|	Обороты.Организация КАК Организация,
	|	НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ) КАК Месяц,
	|	Обороты.Субконто1 КАК Аналитика,
	|	Обороты.СуммаОборотДт КАК ЗначениеФакт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц, Счет.КодБыстрогоВыбора В (""4401"", ""4402""),,,,) КАК
	|		Обороты";
	СтатьяОбъект.Записать();

КонецПроцедуры

&НаСервере
Процедура СоздатьСтатьюEbitda()
	
	Идентификатор = "Ebitda";
	Статья = Справочники.бджСтатьиБюджетаДоходовИРасходов.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если Не ЗначениеЗаполнено(Статья) Тогда
		СтатьяОбъект = Справочники.бджСтатьиБюджетаДоходовИРасходов.СоздатьЭлемент();
		СтатьяОбъект.Идентификатор 	= Идентификатор;	
		СтатьяОбъект.Использовать 	= Истина;
	Иначе
		СтатьяОбъект = Статья.ПолучитьОбъект();
	КонецЕсли;	
	СтатьяОбъект.Порядок 		= 110;
	СтатьяОбъект.Наименование 	= НСтр("ru = 'Ebitda'");		
	СтатьяОбъект.ТипАналитики 	= Перечисления.бджТипыАналитикиСтатейБюджетаДоходовИРасходов.БезАналитики;
	СтатьяОбъект.Описание 		= НСтр("ru = 'Валовая прибыль - Управленческие расходы - Коммерческие расходы'");
	СтатьяОбъект.ТекстЗапросаПолученияФакта =
	"ВЫБРАТЬ
	|	РезультатНеСгруппированный.Организация КАК Организация,
	|	РезультатНеСгруппированный.Месяц КАК Месяц,
	|	СУММА(РезультатНеСгруппированный.ЗначениеФакт) КАК ЗначениеФакт
	|ИЗ
	|	(ВЫБРАТЬ
	|		Обороты.Организация КАК Организация,
	|		НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ) КАК Месяц,
	|		Обороты.Субконто1 КАК Аналитика,
	|		Обороты.СуммаОборотКт КАК ЗначениеФакт // Выручка
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц,
	|			Счет.КодБыстрогоВыбора = ""90011"",,,,) КАК Обороты
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Обороты.Организация,
	|		НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ),
	|		Обороты.Субконто1,
	|		-Обороты.СуммаОборотДт // НДС
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц,
	|			Счет.КодБыстрогоВыбора = ""9003"",,,,) КАК Обороты
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Обороты.Организация,
	|		НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ),
	|		Обороты.Субконто1,
	|		-Обороты.СуммаОборотДт // Себестоимость
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц,
	|			Счет.КодБыстрогоВыбора = ""2001"",,,,) КАК Обороты
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Обороты.Организация,
	|		НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ),
	|		Обороты.Субконто1,
	|		-Обороты.СуммаОборотДт // Управленческие расходы
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц, Счет.КодБыстрогоВыбора = ""26"",,
	|			ВЫРАЗИТЬ(Субконто1 КАК Справочник.СтатьиЗатрат).Наименование <> ""Амортизация"",,) КАК Обороты
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Обороты.Организация,
	|		НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ),
	|		Обороты.Субконто1,
	|		-Обороты.СуммаОборотДт // Коммерческие расходы
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц,
	|			Счет.КодБыстрогоВыбора В (""4401"", ""4402""),,,,) КАК Обороты) КАК РезультатНеСгруппированный
	|СГРУППИРОВАТЬ ПО
	|	РезультатНеСгруппированный.Организация,
	|	РезультатНеСгруппированный.Месяц";
	СтатьяОбъект.Записать();

КонецПроцедуры

&НаСервере
Процедура СоздатьСтатьюПрочиеДоходы()
	
	Идентификатор = "ПрочиеДоходы";
	Статья = Справочники.бджСтатьиБюджетаДоходовИРасходов.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если Не ЗначениеЗаполнено(Статья) Тогда
		СтатьяОбъект = Справочники.бджСтатьиБюджетаДоходовИРасходов.СоздатьЭлемент();
		СтатьяОбъект.Идентификатор 	= Идентификатор;	
		СтатьяОбъект.Использовать 	= Истина;
	Иначе
		СтатьяОбъект = Статья.ПолучитьОбъект();
	КонецЕсли;	
	СтатьяОбъект.Порядок 		= 120;
	СтатьяОбъект.Наименование 	= НСтр("ru = 'Прочие доходы'");		
	СтатьяОбъект.ТипАналитики 	= Перечисления.бджТипыАналитикиСтатейБюджетаДоходовИРасходов.ПрочиеДоходыИРасходы;
	СтатьяОбъект.Описание 		= НСтр("ru = 'Обороты Дт счета 91.01'");
	СтатьяОбъект.ТекстЗапросаПолученияФакта =
	"ВЫБРАТЬ
	|	Обороты.Организация КАК Организация,
	|	НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ) КАК Месяц,
	|	Обороты.Субконто1 КАК Аналитика,
	|	Обороты.СуммаОборотКт КАК ЗначениеФакт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц,
	|		Счет.КодБыстрогоВыбора = ""9101"",,,,) КАК Обороты";
	СтатьяОбъект.Записать();

КонецПроцедуры

&НаСервере
Процедура СоздатьСтатьюПрочиеРасходы()
	
	Идентификатор = "ПрочиеРасходы";
	Статья = Справочники.бджСтатьиБюджетаДоходовИРасходов.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если Не ЗначениеЗаполнено(Статья) Тогда
		СтатьяОбъект = Справочники.бджСтатьиБюджетаДоходовИРасходов.СоздатьЭлемент();
		СтатьяОбъект.Идентификатор 	= Идентификатор;	
		СтатьяОбъект.Использовать 	= Истина;
	Иначе
		СтатьяОбъект = Статья.ПолучитьОбъект();
	КонецЕсли;	
	СтатьяОбъект.Порядок 		= 130;
	СтатьяОбъект.Наименование 	= НСтр("ru = 'Прочие расходы'");		
	СтатьяОбъект.ТипАналитики 	= Перечисления.бджТипыАналитикиСтатейБюджетаДоходовИРасходов.ПрочиеДоходыИРасходы;
	СтатьяОбъект.Описание 		= НСтр("ru = 'Обороты Дт счета 91.02'");
	СтатьяОбъект.ТекстЗапросаПолученияФакта =
	"ВЫБРАТЬ
	|	Обороты.Организация КАК Организация,
	|	НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ) КАК Месяц,
	|	Обороты.Субконто1 КАК Аналитика,
	|	Обороты.СуммаОборотДт КАК ЗначениеФакт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц,
	|		Счет.КодБыстрогоВыбора = ""9102"",,,,) КАК Обороты";
	СтатьяОбъект.Записать();

КонецПроцедуры

&НаСервере
Процедура СоздатьСтатьюПрибыльДоНалогооблажения()
	
	Идентификатор = "ПрибыльДоНалогооблажения";
	Статья = Справочники.бджСтатьиБюджетаДоходовИРасходов.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если Не ЗначениеЗаполнено(Статья) Тогда
		СтатьяОбъект = Справочники.бджСтатьиБюджетаДоходовИРасходов.СоздатьЭлемент();
		СтатьяОбъект.Идентификатор 	= Идентификатор;	
		СтатьяОбъект.Использовать 	= Истина;
	Иначе
		СтатьяОбъект = Статья.ПолучитьОбъект();
	КонецЕсли;	
	СтатьяОбъект.Порядок 		= 140;
	СтатьяОбъект.Наименование 	= НСтр("ru = 'Прибыль до налогообложения'");		
	СтатьяОбъект.ТипАналитики 	= Перечисления.бджТипыАналитикиСтатейБюджетаДоходовИРасходов.БезАналитики;
	СтатьяОбъект.Описание 		= НСтр("ru = 'Ebitda  + Прочие доходы (обороты счета 90.01) - Прочие расходы (обороты счета 90.02)'");
	СтатьяОбъект.ТекстЗапросаПолученияФакта =
	"ВЫБРАТЬ
	|	РезультатНеСгруппированный.Организация КАК Организация,
	|	РезультатНеСгруппированный.Месяц КАК Месяц,
	|	СУММА(РезультатНеСгруппированный.ЗначениеФакт) КАК ЗначениеФакт
	|ИЗ
	|	(ВЫБРАТЬ
	|		Обороты.Организация КАК Организация,
	|		НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ) КАК Месяц,
	|		Обороты.Субконто1 КАК Аналитика,
	|		Обороты.СуммаОборотКт КАК ЗначениеФакт // Выручка
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц,
	|			Счет.КодБыстрогоВыбора = ""90011"",,,,) КАК Обороты
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Обороты.Организация,
	|		НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ),
	|		Обороты.Субконто1,
	|		-Обороты.СуммаОборотДт // НДС
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц,
	|			Счет.КодБыстрогоВыбора = ""9003"",,,,) КАК Обороты
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Обороты.Организация,
	|		НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ),
	|		Обороты.Субконто1,
	|		-Обороты.СуммаОборотДт // Себестоимость
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц,
	|			Счет.КодБыстрогоВыбора = ""2001"",,,,) КАК Обороты
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Обороты.Организация,
	|		НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ),
	|		Обороты.Субконто1,
	|		-Обороты.СуммаОборотДт // Управленческие расходы и Амортизация
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц, Счет.КодБыстрогоВыбора = ""26"",,,,) КАК
	|			Обороты
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Обороты.Организация,
	|		НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ),
	|		Обороты.Субконто1,
	|		-Обороты.СуммаОборотДт // Коммерческие расходы
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц, Счет.КодБыстрогоВыбора В (""4401"",
	|			""4402""),,,,) КАК Обороты
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Обороты.Организация,
	|		НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ),
	|		Обороты.Субконто1,
	|		Обороты.СуммаОборотКт // Прочие доходы
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц,
	|			Счет.КодБыстрогоВыбора = ""9101"",,,,) КАК Обороты
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Обороты.Организация,
	|		НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ),
	|		Обороты.Субконто1,
	|		-Обороты.СуммаОборотДт // Прочие расходы
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Месяц,
	|			Счет.КодБыстрогоВыбора = ""9102"",,,,) КАК Обороты) КАК РезультатНеСгруппированный
	|СГРУППИРОВАТЬ ПО
	|	РезультатНеСгруппированный.Организация,
	|	РезультатНеСгруппированный.Месяц";
	СтатьяОбъект.Записать();

КонецПроцедуры

#КонецОбласти