#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьСтатьиПоУмолчанию(Команда)
	ЗаполнитьСтатьиПоУмолчаниюНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСтатьиПоУмолчаниюНаСервере()
	
	СоздатьСтатьюПродажи();
	СоздатьСтатьюВыручка();
	
	Элементы.Список.Обновить();

КонецПроцедуры

&НаСервере
Процедура СоздатьСтатьюПродажи()
	
	Идентификатор = "ПродажиКоличество";
	Статья = Справочники.бджСтатьиБюджетаДоходовИРасходов.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если Не ЗначениеЗаполнено(Статья) Тогда
		СтатьяОбъект = Справочники.бджСтатьиБюджетаДоходовИРасходов.СоздатьЭлемент();
		СтатьяОбъект.Идентификатор 	= Идентификатор;	
		СтатьяОбъект.Использовать 	= Истина;	
		СтатьяОбъект.Порядок 		= 10;
	Иначе
		СтатьяОбъект = Статья.ПолучитьОбъект();
	КонецЕсли;	
	СтатьяОбъект.Наименование = "Продажи, шт.";		
	СтатьяОбъект.ТипАналитики = Перечисления.бджТипыАналитикиСтатейБюджетаДоходовИРасходов.НоменклатурнаяГруппа;
	СтатьяОбъект.ТекстЗапросаПолученияФакта =
	"ВЫБРАТЬ
	|	ХозрасчетныйОборотыДтКт.Организация КАК Организация,
	|	НАЧАЛОПЕРИОДА(ХозрасчетныйОборотыДтКт.Период, МЕСЯЦ) КАК Месяц,
	|	ХозрасчетныйОборотыДтКт.СубконтоКт1 КАК Аналитика,
	|	ХозрасчетныйОборотыДтКт.КоличествоОборотКт КАК ЗначениеФакт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачалоПериода, &КонецПериода, Месяц,,,
	|		СчетКт.КодБыстрогоВыбора = ""90011"",,) КАК ХозрасчетныйОборотыДтКт";
	СтатьяОбъект.Записать();

КонецПроцедуры

&НаСервере
Процедура СоздатьСтатьюВыручка()
	
	Идентификатор = "Выручка";
	Статья = Справочники.бджСтатьиБюджетаДоходовИРасходов.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если Не ЗначениеЗаполнено(Статья) Тогда
		СтатьяОбъект = Справочники.бджСтатьиБюджетаДоходовИРасходов.СоздатьЭлемент();
		СтатьяОбъект.Идентификатор 	= Идентификатор;	
		СтатьяОбъект.Использовать 	= Истина;	
		СтатьяОбъект.Порядок 		= 20;
	Иначе
		СтатьяОбъект = Статья.ПолучитьОбъект();
	КонецЕсли;	
	СтатьяОбъект.Наименование = "Выручка, руб.";		
	СтатьяОбъект.ТипАналитики = Перечисления.бджТипыАналитикиСтатейБюджетаДоходовИРасходов.НоменклатурнаяГруппа;
	СтатьяОбъект.ТекстЗапросаПолученияФакта =
	"ВЫБРАТЬ
	|	ХозрасчетныйОборотыДтКт.Организация КАК Организация,
	|	НАЧАЛОПЕРИОДА(ХозрасчетныйОборотыДтКт.Период, МЕСЯЦ) КАК Месяц,
	|	ХозрасчетныйОборотыДтКт.СубконтоКт1 КАК Аналитика,
	|	ХозрасчетныйОборотыДтКт.СуммаОборот КАК ЗначениеФакт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачалоПериода, &КонецПериода, Месяц,,,
	|		СчетКт.КодБыстрогоВыбора = ""90011"",,) КАК ХозрасчетныйОборотыДтКт";
	СтатьяОбъект.Записать();

КонецПроцедуры

#КонецОбласти