#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДокументРезультат.Очистить();
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
		
	Период 						= НастройкиОтчета.ПараметрыДанных.Элементы.Найти("Период").Значение;
	Организация 				= НастройкиОтчета.ПараметрыДанных.Элементы.Найти("Организация").Значение;
	
	МакетКомпоновки = ЗарплатаКадрыОтчеты.МакетКомпоновкиДанных(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	
	// Создадим и инициализируем процессор компоновки.
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;    
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, Новый Структура("БюджетДоходовИРасходов", ПолучитьБюджетДоходовИРасходов(Период, Организация)), ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	// Обозначим начало вывода
	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	
	ДопСвойства = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;
	ДопСвойства.Вставить("ОтчетПустой", ОтчетыСервер.ОтчетПустой(ЭтотОбъект, ПроцессорКомпоновки));                         
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции 

// Для общей формы "Форма отчета" подсистемы "Варианты отчетов".
// 
// Параметры:
//  Форма 			- ФормаКлиентскогоПриложения
//  КлючВарианта 	- Строка
//  Настройки 		- Произвольный
//  
//@skip-check module-empty-method
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт		
КонецПроцедуры

// Получить бюджет доходов и расходов.
// 
// Параметры:
//  Период 		- СтандартныйПериод 			- Период
//  Организация - СправочникСсылка.Организации 	- Организация
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица бюджета доходов и расходов
//
Функция ПолучитьБюджетДоходовИРасходов(Период, Организация)

	// TODO: Реализовать функционал получения таблицы бюджета доходов и расходов

	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("НачалоПериода", 	Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", 	Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	
	Запрос.Текст =	
	"";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли